## Transformation â€“ Curated Tables for BI

In [14]:
import pandas as pd

In [15]:
orders = pd.read_csv('../data/raw/orders.csv')
order_items = pd.read_csv('../data/raw/order_items.csv')

In [16]:
print(f'Orders Shape :{orders.shape}')
print(f"Order_items Shape : {order_items.shape}")

Orders Shape :(32313, 8)
Order_items Shape : (40025, 7)

In [17]:
orders.columns

Index(['order_id', 'created_at', 'website_session_id', 'user_id',
       'primary_product_id', 'items_purchased', 'price_usd', 'cogs_usd'],
      dtype='object')

In [18]:
order_items.columns

Index(['order_item_id', 'created_at', 'order_id', 'product_id',
       'is_primary_item', 'price_usd', 'cogs_usd'],
      dtype='object')

In [19]:
orders_cols = [
    "order_id",
    "website_session_id",
    "created_at",
    "user_id"
]

order_items_cols = [
    "order_item_id",
    "order_id",
    "product_id",
    "price_usd",
    "cogs_usd",
    "is_primary_item"
]

orders = orders[orders_cols]
order_items = order_items[order_items_cols]

Creating **Sales** table

In [ ]:
sales = order_items.merge(
    orders,
    on='order_id',
    how='left'
)

In [ ]:
sales['revenue_usd'] = sales['price_usd']
sales['profit_usd'] = sales['price_usd'] - sales['cogs_usd']

In [ ]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40025 entries, 0 to 40024
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_item_id       40025 non-null  int64
 1   order_id            40025 non-null  int64
 2   product_id          40025 non-null  int64
 3   price_usd           40025 non-null  float64
 4   cogs_usd            40025 non-null  float64
 5   is_primary_item     40025 non-null  int64
 6   website_session_id  40025 non-null  int64
 7   created_at          40025 non-null  object
 8   user_id             40025 non-null  int64
 9   revenue_usd         40025 non-null  float64
 10  profit_usd          40025 non-null  float64
dtypes: float64(4), int64(6), object(1)
memory usage: 3.4+ MB

In [ ]:
sales.head()

,order_item_id,order_id,product_id,price_usd,cogs_usd,is_primary_item,website_session_id,created_at,user_id,revenue_usd,profit_usd
0,1,1,1,49.99,19.49,1,20,2012-03-19 10:42:46,20,49.99,30.5
1,2,2,1,49.99,19.49,1,104,2012-03-19 19:27:37,104,49.99,30.5
2,3,3,1,49.99,19.49,1,147,2012-03-20 06:44:45,147,49.99,30.5
3,4,4,1,49.99,19.49,1,160,2012-03-20 09:41:45,160,49.99,30.5
4,5,5,1,49.99,19.49,1,177,2012-03-20 11:28:15,177,49.99,30.5

In [ ]:
sales.to_csv("../Data/processed/sales.csv",index=False)

creating **refund** table

In [26]:
refunds_table = pd.read_csv("../data/raw/order_item_refunds.csv")
print(refunds_table.shape)

(1731, 5)

In [27]:
refunds_cols = [
    "order_item_refund_id",
    "order_item_id",
    "order_id",
    "created_at",
    "refund_amount_usd"
]

refunds = refunds_table[refunds_cols]

In [28]:
refunds.info()
refunds.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1731 entries, 0 to 1730
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   order_item_refund_id  1731 non-null   int64
 1   order_item_id         1731 non-null   int64
 2   order_id              1731 non-null   int64
 3   created_at            1731 non-null   object
 4   refund_amount_usd     1731 non-null   float64
dtypes: float64(1), int64(3), object(1)
memory usage: 67.7+ KB

,order_item_refund_id,order_item_id,order_id,created_at,refund_amount_usd
0,1,57,57,2012-04-06 11:32:43,49.99
1,2,74,74,2012-04-13 01:09:43,49.99
2,3,71,71,2012-04-15 07:03:48,49.99
3,4,118,118,2012-04-17 20:00:37,49.99
4,5,116,116,2012-04-22 20:53:49,49.99

In [29]:
refunds.to_csv("../data/processed/refunds.csv", index=False)

create **product** table

In [30]:
products = pd.read_csv("../data/raw/products.csv")
print(products.shape)

(4, 3)

In [31]:
product = products[
    [
        "product_id",
        "product_name",
        "created_at"
    ]
]

In [32]:
product.info()
product.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    4 non-null      int64
 1   product_name  4 non-null      object
 2   created_at    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

   product_id                product_name           created_at
0           1      The Original Mr. Fuzzy  2012-03-19 08:00:00
1           2       The Forever Love Bear  2013-01-06 13:00:00
2           3    The Birthday Sugar Panda  2013-12-12 09:00:00
3           4  The Hudson River Mini bear  2014-02-05 10:00:00

In [33]:
product.to_csv("../data/processed/product.csv", index=False)

create **sessions** table

In [35]:
web_sessions = pd.read_csv("../data/raw/website_sessions.csv")
print(web_sessions.shape)

(472871, 9)

In [38]:
session = web_sessions[
    [
        "website_session_id",
        "user_id",
        "is_repeat_session",
        "utm_source",
        "utm_campaign",
        "utm_content",
        "device_type",
        "http_referer",
        "created_at"
    ]
]

In [39]:
session["utm_source"] = session["utm_source"].fillna("direct")
session["utm_campaign"] = session["utm_campaign"].fillna("none")
session["utm_content"] = session["utm_content"].fillna("none")
session["http_referer"] = session["http_referer"].fillna("direct")

In [40]:
session.info()
session.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472871 entries, 0 to 472870
Data columns (total 9 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   website_session_id  472871 non-null  int64
 1   user_id             472871 non-null  int64
 2   is_repeat_session   472871 non-null  int64
 3   utm_source          472871 non-null  object
 4   utm_campaign        472871 non-null  object
 5   utm_content         472871 non-null  object
 6   device_type         472871 non-null  object
 7   http_referer        472871 non-null  object
 8   created_at          472871 non-null  object
dtypes: int64(3), object(6)
memory usage: 32.5+ MB

,website_session_id,user_id,is_repeat_session,utm_source,utm_campaign,utm_content,device_type,http_referer,created_at
0,1,1,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com,2012-03-19 08:04:16
1,2,2,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com,2012-03-19 08:16:49
2,3,3,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com,2012-03-19 08:26:55
3,4,4,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com,2012-03-19 08:37:33
4,5,5,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com,2012-03-19 09:00:55

In [41]:
session.to_csv("../data/processed/session.csv", index=False)

creating **date** table

In [42]:
dates = pd.concat([
    sales["created_at"],
    refunds["created_at"],
    session["created_at"],
    product["created_at"]
]).dropna()

dates = pd.to_datetime(dates)

In [43]:
date_df = pd.DataFrame({
    "date": pd.date_range(dates.min(), dates.max(), freq="D")
})

In [ ]:
date_df['year'] = date_df['date'].dt.year
date_df['month'] = date_df['date'].dt.month
date_df['month_name'] = date_df['date'].dt.month_name
date_df['quarter'] = date_df['date'].dt.quarter
date_df['week'] = date_df['date'].dt.isocalendar().week
date_df['day'] = date_df['date'].dt.day

In [46]:
date_df.to_csv("../data/processed/dates.csv", index=False)